# Dict of films
MOVIES = {
    "Комедії": [
        "1+1", "Маска", "Як позбутися хлопця за 10 днів", 
        "Труднощі перекладу", "Шалена ніч", "Сімейка Адамсів"
    ],
    "Драми": [
        "Зелена миля", "Втеча з Шоушенка", "Бійцівський клуб", 
        "Дівчина з татуюванням дракона", "Титанік", "Амелі"
    ],
    "Фантастика": [
        "Початок", "Інтерстеллар", "Матриця", 
        "Зоряні війни: Епізод IV", "Дюна", "Аватар"
    ],
    "Мультфільми": [
        "Король Лев", "Шрек", "Рататуй", 
        "Душа", "Холодне серце", "Сімейка Крудсів"
    ],
    "Трилери": [
        "Сім", "Мовчання ягнят", "Острів проклятих", 
        "Зодіак", "Гра", "Ворог"
    ],
    "Жахи": [
        "Закляття", "Астрал", "Сяйво", 
        "Хеллоуїн", "Тихе місце", "Воно"
    ],
    "Бойовики": [
        "Джон Вік", "Міцний горішок", "Гладіатор", 
        "Термінатор 2: Судний день", "Рейд", "Місія нездійсненна"
    ],
    "Пригоди": [
        "Індіана Джонс: У пошуках втраченого ковчега", 
        "Володар перснів: Братство персня", 
        "Пірати Карибського моря: Прокляття Чорної перлини", 
        "Джуманджі", "Життя Пі", "Книга джунглів"
    ],
    "Фентезі": [
        "Гаррі Поттер і філософський камінь", "Хроніки Нарнії", 
        "Лабіринт Фавна", "Володар перснів: Повернення короля", 
        "Білий олеандр", "Золотий компас"
    ],
    "Романтика": [
        "Щоденник пам'яті", "Сутінки", "З Парижа з любов’ю", 
        "500 днів літа", "Ла-Ла Ленд", "Титанік"
    ],
    "Мюзикли": [
        "Величний шоумен", "Мама Мія!", "Чикаго", 
        "Красуня і Чудовисько", "Рок на віки", "Ла-Ла Ленд"
    ],
    "Історичні": [
        "Список Шиндлера", "Гладіатор", "Король говорить", 
        "12 років рабства", "Хоробре серце", "Темні часи"
    ],
    "Документальні": [
        "Мандрівники часу", "Планета Земля", "13-та поправка", 
        "Морські хижаки", "Соціальна дилема", "Я не твій негр"
    ],
    "Сімейні": [
        "Малефісента", "Піноккіо", "Пригоди Паддінгтона", 
        "Диво", "Коко", "Лего Фільм"
    ],
    "Кримінальні": [
        "Хрещений батько", "Обличчя зі шрамом", "Казино", 
        "Джентльмени", "Славні хлопці", "Великий куш"
    ],
    "Детективи": [
        "Ножі наголо", "Вбивство в «Східному експресі»", "Шерлок Холмс", 
        "Десять негритят", "Вікно у двір", "Дівчина з татуюванням дракона"
    ],
    "Аніме": [
        "Мій сусід Тоторо", "Зошит смерті", "Ходячий замок", 
        "Принцеса Мононоке", "Наруто", "Кімната із ліліями"
    ],
    "Спортивні": [
        "Роккі", "Мільйонер з нетрів", "Скарб", 
        "Гра на виживання", "Форд проти Феррарі", "Дух команди"
    ],
    "Біографічні": [
        "Богемна рапсодія", "Соціальна мережа", "Рей", 
        "Капоте", "Король Річард", "Ігри розуму"
    ]
}

NEWS_URL = 'https://uaserial.tv/search?query=2024'

GENRE_MAPPING = {
    'жахи': 'Жахи',
    'комедія': 'Комедії',
    'драма': 'Драми',
    'романтичний': 'Романтика',
    'кримінальний': 'Кримінальні',
    'воєнний': 'Воєнний',
    'спорт': 'Спортивні',
    'трилер': 'Трилери',
    'пригоди': 'Пригоди',
    'екшн': 'Екшн',
    'вестерн': 'Вестерн',
    'документальний': 'Документальні'
}